// Випадковим чином генерується масив номерів робочих днів,
//  або назв вихідних, або назв святкових днів. 
// Підрахувати чого було більше: святкових чи вихідних.

let arr = ["субота", "неділя", "Новий рік", "понеділок", "Різдво"] as const;

let holidays = 0;
let weekends = 0;

for (let day of arr) {
    if (day === "субота" || day === "неділя") weekends++;
    if (day === "Новий рік" || day === "Різдво") holidays++;
}

console.log(holidays > weekends ? "Святкових більше" : weekends > holidays ? "Вихідних більше" : "Однаково");